system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         10000;

deltaT          1;

writeControl    runTime;

writeInterval   100;

purgeWrite      2;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

functions
{
     inlet_Vflow
     {
	    type	               surfaceFieldValue;
	    libs	               ("libfieldFunctionObjects.so");
	    enabled			true;
	    log			     false;
	    writeControl         timeStep;
         writeInterval         1;
         writeFields           false;
	    regionType	          patch;
	    name		          inlet_cyclicAMI;
	    operation	          sum;
	    fields               (phi);
     }

     myWallStress
     {
          type                myWallShearStress;
          libs                ("libmyFieldFunctionObjects.so");
          patches             (TPMS);
          enabled		     true;
          log			     false;
          writeControl        runTime;
          writeInterval       100;
          writeFields         false;
     }

}
// ************************************************************************* //