system/controlDictScalar
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     scalarTransportFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         10200;

deltaT          1;

writeControl    runTime;

writeInterval   50;

purgeWrite      1;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

functions
{
  components1
  {
    type              components;
    libs              (fieldFunctionObjects);
    field             U;
    region            region0;
    enabled			      true;
	  log			          false;
	  writeControl      runTime;
    writeInterval     50;
    writeFields       false;
  }

  Tm
  {
    type	          volFieldValue;
    libs	          (fieldFunctionObjects);
    enabled			    true;
    log			        false;
    writeControl    timeStep;
    writeInterval   1;
    writeFields     false;
    operation	      weightedVolAverage;
    fields          (T);
    weightField     Uy;
  }
  #includeFunc  "Tbulk1"
  #includeFunc  "Tbulk2"
  #includeFunc "Tw"

}
// ************************************************************************* //