system/createPatchDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;
patches
(
    {
        // Name of new patch
        name outlet;
        // Type of new patch
        patchInfo
        {
            type patch;
        }
        // How to construct: either from 'patches' or 'set'
        constructFrom patches;
        // If constructFrom = patches : names of patches. Wildcards allowed.
        patches (outlet_cyclicAMI);
    }
    {
        name    inlet;
        patchInfo
        {
            type            patch;
        }
        constructFrom patches;
        patches (inlet_cyclicAMI);
    }
);
