0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField uniform 0;

boundaryField
{
    // outlet_cyclicAMI
	// {
	// 	type		fixedJumpAMI;
	// 	patchType	cyclicAMI;
    //     jump	    uniform	5e-4;
	// 	value		$internalField;
	// }
    // inlet_cyclicAMI
	// {
	// 	type		fixedJumpAMI;
	// 	patchType	cyclicAMI;
	// 	value		$internalField;
	// }
    TPMS
    {
        type        zeroGradient;
    }
    ".*"
    {
        type        cyclicAMI;
    }
}

// ************************************************************************* //
